Revit 2027 API
CompoundStructure.GetWallSweepsInfo Method
 Obtains a list of the intrinsic wall sweeps or reveals in this CompoundStructure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<WallSweepInfo> GetWallSweepsInfo(
	WallSweepType wallSweepType
)
Public Function GetWallSweepsInfo (
	wallSweepType As WallSweepType
) As IList(Of WallSweepInfo)
public:
IList<WallSweepInfo^>^ GetWallSweepsInfo(
	WallSweepType wallSweepType
)
member GetWallSweepsInfo :
        wallSweepType : WallSweepType -> IList<WallSweepInfo>
Parameters
wallSweepType WallSweepType
 Whether to obtain wall sweeps or reveals.
Return Value
IList<WallSweepInfo>
 An array which describes the intrinsic wall sweeps or reveals.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace